<script setup>
const emit = defineEmits(["close"]);
const props = defineProps(["visible"]);

const onClose = () => {
  emit("close");
};
</script>
<template>
  <a-drawer
    title="基本信息"
    :width="720"
    :visible="props.visible"
    :body-style="{ paddingBottom: '80px' }"
    :footer-style="{ textAlign: 'right' }"
    @close="onClose"
  >
    <span>流域概况</span>
    <br />
    丰乐水库位于安徽省黄山市境内、黄山南麓的丰乐河上游，属新安江流域。地处徽州区呈坎镇石川村，上距黄山风景区50km，下距全国历史文化名城--歙县25km。水库控制流域面积287km，占该河流域面积(514km)的55.84%。坝址以上主河道长47km，平均坡降0.542%。坝址下游7km处建有丰乐灌区引水枢纽(二坝)，控制灌溉范围136km，灌溉面积11.2万亩。丰乐水库下泄洪水经徽州区到歙县县城与布射、富资、扬之等三水汇合后流入练江至新安江。
    <br />
    <span>水文、气象</span>
    <br />
    丰乐水库位于亚热带季风气候区，受东亚季风影响。总的气候特征是四季分明，气候温和，雨量充沛，年平均气温16.4℃，多年平均降雨量为1872mm，建库以来最大日平均降雨量185.5mm.3天面降雨量463.1mm发生在1996年;建库以来最大入库流量2390m/s，最大出库流量1400m/s，发生在1991年7月7日;历史年最高蓄水位207.26m，发生在1996年6月30日。
    <br />
    <span>特征水位及库容</span>
    <br />
    丰乐水库按50年一遇设计，500年一遇校核。水库500年一遇校核洪水位210.72m(吴淞基面高程，下同)，相应最大洪峰来量4368m³/s，最大泄量3006m³/s，其中坝顶溢洪道2106m³/s，泄洪洞泄洪900m³/s，相应尾水位为170.50m;50年一遇设计洪水位为207.84m，相应最大洪峰来量2718m³/s，最大泄量1737m³/s,其中坝顶溢洪道泄洪947m³/s，泄洪洞泄洪790m³/s，相应尾水位为167.80m;5月1日至8月31日汛限水位201m，9月1日至4月30日最高水位控制在203m;死水位为183.00m。水库总库容8430万m³，其中防洪库容为3510万m³，兴利库容3840万m³，死库容1080万m³。
    <br />
    <span>防洪任务现状</span>
    <br />
    丰乐水库按50年一遇设计，500年一遇校核达到部颁标准的下限。水库下游徽州区城区防洪标准为近期20年一遇，远期为50年一遇，岩寺镇河段按20年一遇防洪标准考虑的安全下泄流量为1300m³/s。丰乐河作为新安江流域的一部分，其防洪规划是与新安江流域综合治理、防洪要求相协调一致的，现按近期20年一遇考虑其防洪要求。丰乐水库占岩寺镇以上面积约70%，控制岩寺镇以上主要的来水面积，现按暴雨中心在坝址以上，坝址至岩寺镇区间相应考虑。目前岩寺镇河段现有防洪标准只有20年一遇，丰乐水库为满足岩寺镇二十年一遇，需控制泄量不大于910m³/s。
    <br />
    <span>供水任务现状 </span>
    <br />
    主要满足徽州区、歙县、屯溪新城区城镇供水，下游沿途城乡生活用水、丰乐灌区农业灌溉用水、丰乐河下游生态供水等需求。城镇供水主要通过供水管道向歙县二水厂、徽州区二水厂和黄山市第五水厂供水，现供水量达6万立方米/天;丰乐灌区农业灌溉用水通过丰乐水电站发电尾水与丰乐二坝水库枢纽工程及丰乐灌区南北灌渠实施，设计灌溉面积11.2万亩。全年保障下游生态流量，满足日均出库流量不小于0.81立方米每秒的考核目标，特枯水年份可根据实际来水情况调整。
    <br />
    <span>洪水特性</span>
    <br />
    丰乐水库位于亚热带季风气候区，受东亚季风影响。总的气候特征是四季分明，气候温和，雨量充沛，年平均气温16.4℃，多年平均降雨量为1872mm，流域洪水的季节性明显，洪水过程主要集中在57月份的“梅雨”季节和8~9月份的台风影响期。建库以来最大日平均降雨量185.5mm，3天面降雨量463.1mm，发生在1996年;建库以来最大入库流量2390m/s，最大出库流量1400m3/s，发生在1991年7月7日;历史年最高蓄水位207.26m，发生在1996年6月30日。
  </a-drawer>
</template>
<style scoped>
span {
  font-size: 24px;
  font-weight: 600;
}
</style>
